W8D1/RedditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Ruby"], ["url", "asdjkalsjdkl"], ["content", "learn ruby"], ["sub_id", 1], ["author_id", 2], ["created_at", "2021-01-11 22:42:48.037353"], ["updated_at", "2021-01-11 22:42:48.037353"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]

    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "asdsadafsasfgdgw"], ["updated_at", "2021-01-12 00:48:30.168939"], ["id", 12]]
---
  def update
    @post = Post.find_by(id: params[:id])

    if author?(@post)
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 2]]
---
  def destroy

    @post = Post.find_by(id: params[:id])
    if author?(@post)
      redirect_to sub_url(@post.destroy.sub_id)