W7D1/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jonathan"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)
    # find user form table via username
    user = User.find_by(username: username)