W7D1/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jonathan"], ["LIMIT", 1]]
---
  def create
    if User.find_by_credentials(user_params[:username], user_params[:password])
      user = User.find_by(username: username)