W7D1/app/views/users/index.html.erb

<h1><%= @users.first.username %></h1>
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]