W7D2/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("band_id", "title", "year", "record_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["band_id", 1], ["title", "American Idiot"], ["year", 2002], ["record_type", "Studio"], ["created_at", "2021-01-06 05:16:34.480212"], ["updated_at", "2021-01-06 05:16:34.480212"]]
---
  def create
      @album = Album.new(album_params)

      if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 4]]
---
  def destroy
      album = Album.find_by(id: params[:id])

      if album
        redirect_to band_url(album.delete.band_id)