W7D2/music_app/app/controllers/bands_controller.rb

    def create
      @band = Band.new(band_params)

      if @band.save
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "very nice band"], ["created_at", "2021-01-05 22:40:31.741516"], ["updated_at", "2021-01-05 22:40:31.741516"]]

    def update
      band = Band.find_by(id: params[:id])

      if band.update(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "nice"], ["updated_at", "2021-01-05 22:52:13.795388"], ["id", 13]]

    def destroy
      band = Band.find_by(id: params[:id])

      if band.delete
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 6]]