W6D3/Art_Share/app/controllers/artwork_shares_controller.rb

  def create
    artwork_shares = ArtworkShare.new(artwork_shares_params)
    if artwork_shares.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 2], ["created_at", "2020-12-31 00:08:44.928028"], ["updated_at", "2020-12-31 00:08:44.928028"]]

  def destroy
    ArtworkShare.find(params[:id]).delete
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]