W6D3/Art_Share/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.joins(:artist).where(users: {id: params[:user_id]})
---
SELECT "artworks".* FROM "artworks" INNER JOIN "users" ON "users"."id" = "artworks"."artist_id" WHERE "users"."id" = $1  [["id", "user_id"]]

  def create
    artwork = Artwork.new(artwork_params)
    if artwork.save
---
INSERT INTO "artworks" ("title", "artist_id", "created_at", "updated_at", "image_url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Title5"], ["artist_id", 3], ["created_at", "2020-12-30 23:19:25.258425"], ["updated_at", "2020-12-30 23:19:25.258425"], ["image_url", "www.image5.com"]]

  def destroy
    Artwork.find(params[:id]).delete
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 5]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]